examples/fsi/perpendicular-beam/fluid/0.orig/phi
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    object      phi;
}

dimensions      [0 3 -1 0 0 0 0];

internalField   uniform 0;
boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    beam
    {
        type            calculated;
        value           uniform 0;
    }
    floor
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    front
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    back
    {
        type            symmetryPlane;
        value           uniform 0;
    }
}
