examples/fsi/perpendicular-beam/fluid/0.orig/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    top
    {
        type            slip;
    }

    floor
    {
        type            slip;
    }

    front
    {
        type            slip;
    }

    back
    {
        type            slip;
    }

    beam
    {
        type            fixedValue;
        value           $internalField;
    }

}
